In [1]:
'''
Problem 1: Grouping Data
a) Group the data by Gender and calculate the average Marks for each group.
b) Group the data by City and find the total count of students in each city.
Problem 2: Conditional Modifications
a) Add a column called Remark:
If Marks > 80, write "Excellent".
If Marks <= 80, write "Needs Improvement".
Problem 3: Index Reset
Reset the index of the DataFrame to remove the existing indexing.
Problem 4: Filtering Complex Conditions
Filter the DataFrame to show rows where:
Gender is "Male", and Marks > 75, OR
City is "Chicago". '''

SyntaxError: incomplete input (2608017807.py, line 1)

In [1]:
import pandas as pd

In [2]:
d1={"Name":["John","Alice","Bob","Emma"],
"Age":[20,22,12,21],
"Gender":["Male","Female","Male","Female"],
"Marks":[88,92,75,89],
"City":["New York","Los Angeles","Chicago","San Fransico"]}
vr=pd.DataFrame(d1)

In [26]:
a=vr.groupby("Gender")['Marks'].mean()
a

Gender
Female    90.5
Male      81.5
Name: Marks, dtype: float64

In [50]:
a1=vr.groupby("City").size()
a1

City
Chicago         1
Los Angeles     1
New York        1
San Fransico    1
dtype: int64

In [30]:
def mod(Marks):
    if Marks>80:
        return "Excellent"
    else:
        return "Needs Improvement"
vr["Remarks"]=vr["Marks"].apply(mod)
vr

    Name  Age  Gender  Marks          City            Remarks
0   John   20    Male     88      New York          Excellent
1  Alice   22  Female     92   Los Angeles          Excellent
2    Bob   12    Male     75       Chicago  Needs Improvement
3   Emma   21  Female     89  San Fransico          Excellent

In [31]:
vr.reset_index()

   index   Name  Age  Gender  Marks          City            Remarks
0      0   John   20    Male     88      New York          Excellent
1      1  Alice   22  Female     92   Los Angeles          Excellent
2      2    Bob   12    Male     75       Chicago  Needs Improvement
3      3   Emma   21  Female     89  San Fransico          Excellent

In [47]:
a=vr[(vr["Gender"]=="Male")&(vr["Marks"]>75)]
a

   Name  Age Gender  Marks      City    Remarks
0  John   20   Male     88  New York  Excellent

In [40]:
a=vr[vr["City"]=="Chicago"]
a

  Name  Age Gender  Marks     City            Remarks
2  Bob   12   Male     75  Chicago  Needs Improvement